io_test/results/run2/fio.log
>>>>>>> Test 1 (10 15 20 0.100000)job1: (g=0): rw=randwrite, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=128
fio-2.2.9-32-gf02f
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=19910: Wed Aug 19 19:32:31 2015
  write: io=116115MB, bw=185778KB/s, iops=1451, runt=640022msec
    slat (usec): min=47, max=90296, avg=452.86, stdev=2656.95
    clat (usec): min=0, max=2295.8K, avg=48893.98, stdev=191279.22
     lat (usec): min=48, max=2299.9K, avg=49347.15, stdev=192755.02
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    1], 40.00th=[    2], 50.00th=[    2], 60.00th=[    3],
     | 70.00th=[24704], 80.00th=[31872], 90.00th=[95744], 95.00th=[252928],
     | 99.00th=[765952], 99.50th=[1941504], 99.90th=[2211840], 99.95th=[2244608],
     | 99.99th=[2277376]
    bw (KB  /s): min= 7125, max=728320, per=100.00%, avg=186897.38, stdev=160722.24
    lat (usec) : 2=35.98%, 4=24.22%, 10=0.49%, 20=0.03%, 50=0.01%
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=1.21%, 50=25.38%
    lat (msec) : 100=3.20%, 250=4.13%, 500=3.79%, 750=0.53%, 1000=0.15%
    lat (msec) : 2000=0.44%, >=2000=0.42%
  cpu          : usr=1.39%, sys=16.30%, ctx=599078, majf=0, minf=4189
  IO depths    : 1=60.7%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=39.2%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=928921/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=116115MB, aggrb=185777KB/s, minb=185777KB/s, maxb=185777KB/s, mint=640022msec, maxt=640022msec

Disk stats (read/write):
  rbd4: ios=0/322962, merge=0/18005953, ticks=0/86976168, in_queue=87220240, util=98.55%
>>>>>>> Test 2 (10 15 4 0.250000)job1: (g=0): rw=randwrite, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=128
fio-2.2.9-32-gf02f
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=11110: Wed Aug 19 20:04:57 2015
  write: io=153600MB, bw=223923KB/s, iops=1749, runt=702413msec
    slat (usec): min=46, max=1869, avg=116.72, stdev=16.37
    clat (usec): min=0, max=15175, avg= 2.19, stdev=78.71
     lat (usec): min=47, max=15750, avg=119.28, stdev=81.28
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    1], 40.00th=[    1], 50.00th=[    1], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    2], 90.00th=[    2], 95.00th=[    2],
     | 99.00th=[    2], 99.50th=[    3], 99.90th=[    8], 99.95th=[   14],
     | 99.99th=[ 2320]
    bw (KB  /s): min=256000, max=256256, per=100.00%, avg=256140.93, stdev=127.40
    lat (usec) : 2=58.34%, 4=41.26%, 10=0.32%, 20=0.06%, 50=0.01%
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=1.75%, sys=24.03%, ctx=1262023, majf=0, minf=1426
  IO depths    : 1=100.0%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=0.1%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1228800/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=153600MB, aggrb=223922KB/s, minb=223922KB/s, maxb=223922KB/s, mint=702413msec, maxt=702413msec

Disk stats (read/write):
  rbd4: ios=0/646592, merge=0/32154698, ticks=0/82049860, in_queue=82116104, util=97.53%
>>>>>>> Test 3 (10 15 4 0.100000)job1: (g=0): rw=randwrite, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=128
fio-2.2.9-32-gf02f
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=26629: Wed Aug 19 21:06:38 2015
  write: io=153600MB, bw=234637KB/s, iops=1833, runt=670340msec
    slat (usec): min=52, max=1102, avg=115.30, stdev=15.33
    clat (usec): min=0, max=12497, avg= 2.12, stdev=75.29
     lat (usec): min=53, max=12621, avg=117.77, stdev=76.71
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    1], 40.00th=[    1], 50.00th=[    1], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    2], 90.00th=[    2], 95.00th=[    2],
     | 99.00th=[    3], 99.50th=[    3], 99.90th=[    7], 99.95th=[   13],
     | 99.99th=[  796]
    bw (KB  /s): min=256000, max=256256, per=100.00%, avg=256146.55, stdev=126.70
    lat (usec) : 2=58.72%, 4=40.84%, 10=0.37%, 20=0.05%, 50=0.01%
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=1.79%, sys=24.63%, ctx=1255268, majf=0, minf=2625
  IO depths    : 1=100.0%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=0.1%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1228800/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=153600MB, aggrb=234636KB/s, minb=234636KB/s, maxb=234636KB/s, mint=670340msec, maxt=670340msec

Disk stats (read/write):
  rbd4: ios=0/788823, merge=0/35322739, ticks=0/76001692, in_queue=75997640, util=90.02%
>>>>>>> Test 4 (10 15 1 0.500000)job1: (g=0): rw=randwrite, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=128
fio-2.2.9-32-gf02f
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=15486: Wed Aug 19 22:14:21 2015
  write: io=153600MB, bw=243583KB/s, iops=1902, runt=645721msec
    slat (usec): min=50, max=1773, avg=116.84, stdev=15.83
    clat (usec): min=0, max=11671, avg= 2.01, stdev=68.01
     lat (usec): min=50, max=11797, avg=119.20, stdev=69.69
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    1], 40.00th=[    1], 50.00th=[    1], 60.00th=[    1],
     | 70.00th=[    2], 80.00th=[    2], 90.00th=[    2], 95.00th=[    2],
     | 99.00th=[    2], 99.50th=[    3], 99.90th=[    6], 99.95th=[   11],
     | 99.99th=[ 1064]
    bw (KB  /s): min=256000, max=256256, per=100.00%, avg=256145.51, stdev=126.85
    lat (usec) : 2=61.96%, 4=37.68%, 10=0.30%, 20=0.04%, 50=0.01%
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=1.80%, sys=25.66%, ctx=1256615, majf=0, minf=3090
  IO depths    : 1=100.0%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=0.1%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1228800/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=153600MB, aggrb=243582KB/s, minb=243582KB/s, maxb=243582KB/s, mint=645721msec, maxt=645721msec

Disk stats (read/write):
  rbd4: ios=0/908921, merge=0/36822499, ticks=0/71085136, in_queue=71635368, util=86.71%